{
	"data": {
		"viewer": {
			"user": null
		},
		"node": {
			"__typename": "Application",
			"__isAppStoreItem": "Application",
			"id": "2327205800645550",
			"display_name": "FitXR — Box and Dance Fitness",
			"platform": "ANDROID_6DOF",
			"category": "GAMES",
			"item_bundles": [],
			"__isWithHeroMediaCarousel": "Application",
			"trailer": {
				"thumbnail": {
					"uri": "https://scontent.oculuscdn.com/v/t64.5771-25/q92/s1440x1440/57566678_309253293894848_1941958265153303994_n.jpg?_nc_cat=100&ccb=1-3&_nc_sid=79b88e&_nc_ohc=QkCtcxFqqs4AX_N1XZP&_nc_ht=scontent.oculuscdn.com&tp=28&oh=effd5789da1b4fdd341481cc82ec8635&oe=60B2DAA1"
				},
				"uri": "https://scontent.oculuscdn.com/v/t64.7195-25/10000000_1309034749493137_3046799162229166282_n.mp4?_nc_cat=106&ccb=1-3&_nc_sid=0ed769&_nc_ohc=3mksVoF5FKcAX9HSe1V&_nc_ht=scontent.oculuscdn.com&oh=f6fa8111e99c7d1e8f402934a54371cd&oe=60B49B97"
			},
			"quality_rating_histogram_aggregate_all": [
				{
					"star_rating": 1,
					"count": 1689,
					"starRating": 1
				},
				{
					"star_rating": 2,
					"count": 310,
					"starRating": 2
				},
				{
					"star_rating": 3,
					"count": 437,
					"starRating": 3
				},
				{
					"star_rating": 4,
					"count": 797,
					"starRating": 4
				},
				{
					"star_rating": 5,
					"count": 2099,
					"starRating": 5
				}
			],
			"display_long_description": "FitXR brings fitness studio vibes to your home. \n\nFun workouts designed to burn calories, improve strength and get you high on endorphins.\n\nWorkout with friends in real-time multiplayer.\n\nWith a new workout released every day, we’ve got a class for every goal and fitness level. \n\nDownload now for your 7-day free trial. $9.99/month. Cancel at any time. Terms apply.\n\nVoted Oculus’s best fitness VR game of 2020!\n\nA NEW CLASS EVERY DAY\nA new workout led by the world’s top trainers is released daily. Choose from Box & Dance workouts. New HIIT studio coming soon.\n\nWORKOUT WITH FRIENDS\nWorkout in real-time with up to 6 friends in multiplayer and encourage each other over voice chat. Or choose an on-demand group fitness class and take on the leaderboard.\n\nFRESH MUSIC\nPowering your workouts are a host of new tracks from some of the best major and indie music labels.\n\nENERGIZING ENVIRONMENTS\nTurn anywhere into a state-of-the-art fitness club with a choice of environments for all moods!",
			"developer_privacy_policy_url": "https://fitxr.com/privacy",
			"developer_terms_of_service_url": "https://fitxr.com/eula",
			"supported_player_modes": [
				"STANDING",
				"SITTING",
				"ROOM_SCALE"
			],
			"publisher_name": "FitXR",
			"supported_in_app_languages": [
				{
					"name": "德语"
				},
				{
					"name": "日语"
				},
				{
					"name": "法语（法国）"
				},
				{
					"name": "英语"
				},
				{
					"name": "西班牙语（西班牙）"
				}
			],
			"supported_hmd_platforms": [
				"MONTEREY",
				"HOLLYWOOD"
			],
			"supported_input_device_names": [
				"Oculus Touch"
			],
			"user_interaction_mode_names": [
				"单人",
				"多人"
			],
			"age_rating": null,
			"category_name": "游戏",
			"developer_name": "FitXR",
			"genre_names": [
				"动作",
				"体育",
				"音乐"
			],
			"is_360_sensor_setup_required": false,
			"is_concept": false,
			"latest_supported_binary": {
				"__typename": "AndroidBinary",
				"version": "2.0",
				"change_log": "",
				"supported_hmd_types": [
					"MONTEREY",
					"HOLLYWOOD"
				],
				"total_installed_space": "2139302520",
				"id": "4194113280621450",
				"required_space_adjusted": "4009769600",
				"storeAddOns": {
					"__typename": "AndroidBinaryStoreAddonsIncludingBundlesConnection",
					"count": 0
				},
				"firstIapItems": {
					"__typename": "AndroidBinaryStoreAddonsIncludingBundlesConnection",
					"page_info": {
						"end_cursor": null,
						"start_cursor": null
					},
					"count": 0,
					"edges": []
				}
			},
			"recommended_graphics": null,
			"recommended_memory_gb": null,
			"recommended_processor": null,
			"release_date": 1558458000,
			"supported_tracking_modes": [],
			"website_url": "http://www.fitxr.com/",
			"current_offer": {
				"__typename": "AppStoreOffer",
				"offer_type": "APPSTORE_OFFER",
				"id": "4503703136310792",
				"__isPurchasableOfferWithApp": "AppStoreOffer",
				"price": {
					"currency": "USD",
					"offset_amount": "0",
					"formatted": "US$ 0.00"
				},
				"strikethrough_price": null,
				"promo_benefit": null,
				"end_time": 0,
				"show_timer": false,
				"buy_button_captions": [
					{
						"text": "需要订阅。提供应用内购买"
					}
				]
			},
			"viewer_release_channel": {
				"id": "362886484299969"
			},
			"live_release_channel": {
				"id": "362886484299969",
				"channel_name": "LIVE",
				"latest_supported_binary": {
					"__typename": "AndroidBinary",
					"id": "4194113280621450"
				}
			},
			"release_channels": {
				"count": 1,
				"nodes": [
					{
						"channel_name": "LIVE",
						"id": "362886484299969",
						"latest_supported_binary": {
							"__typename": "AndroidBinary",
							"version": "2.0",
							"id": "4194113280621450"
						}
					}
				]
			},
			"grouping": {
				"upcoming_events": {
					"edges": []
				},
				"id": "433988217338682",
				"posts": {
					"nodes": [
						{
							"id": "280015433658170",
							"title": "FitXR Membership Information",
							"created_time": 1618657871,
							"body_text": "PREVIOUS FITXR OWNERS\nTry membership for free for 90-days. Following your trial, you'll receive a prompt asking if you'd like to renew for $9.99/month.\n\nYou won't pay for membership unless you choose to.\n\nIf you decide membership isn't for you, you'll keep all the workouts you had before membership, including any DLC packs bought, forever.\n\nAnd you'll continue to have the new multiplayer feature and environments — plus, you'll still receive future updates, including access to the intro classes of our new HIIT studio.\n\nNEW TO FITXR\nYour trial will be for 7 days. If you choose to cancel your membership, you'll keep access to three short intro classes for each studio.\n\nPlease contact us at support@fitxr.com if you experience any issues.",
							"tile_landscape_image": {
								"uri": "https://scontent.oculuscdn.com/v/t64.5771-25/38974899_1464810890528960_7206704739941707447_n.png?_nc_cat=100&ccb=1-3&_nc_sid=79b88e&_nc_ohc=xC5xCh8w4FoAX-TYF-s&_nc_ht=scontent.oculuscdn.com&oh=7b6e28d76064149b298b4f61eca59187&oe=60B58370"
							}
						},
						{
							"id": "196376768737091",
							"title": "We’ve launched major updates to your favorite virtual fitness club",
							"created_time": 1618241462,
							"body_text": "We at FitXR have big plans to build the most comprehensive virtual fitness club on the planet. And so we’re launching a bunch of major updates that we cannot wait for you to try.\n\nThe brand new features mean you will be able to workout with your friends via a new Multiplayer feature, have access to the full library of on-demand classes, take up fresh classes offered each day and enjoy original tracks from major and indie record labels. On top of this, we’ll also be launching our third fitness studio, coming very soon. So keep your eyes peeled for that!\n\nWhat’s new: key features\n\nWe’re extremely proud to have such a passionate community so we make sure we listen to our customers and use this feedback to continuously improve the FitXR experience. We believe the best way to do this is by constantly delivering fresh content and upgrades, so we’re excited to launch a new membership model, which is available from today on the Oculus Quest platform for $9.99 a month.\n\nTo thank our existing users for being such loyal fans, we’ll be giving them a 90-day free membership at launch, while new members will have access to a 7-day free membership trial. However, membership is completely optional so if you’re an existing user, you don’t have to sign up if you don’t want to - the app will stay as-is without you losing any previously purchased content and you’ll still get to enjoy multiplayer and some HIIT classes once they’re released.\n\nAs part of your membership, you’ll get:\n\n- A new class released every day\n- Multiplayer\n- Brand new studios — HIIT launching mid-May\n- Music from major and indie record labels\n- New Environments\n- Refreshed menu and easier navigation\n\nFitXR: A step above the rest\n\nFitXR was founded with a fitness-first mission; with an aim to make fitness approachable, and fun, for all. Since 2017, we have listened intently to you, our community, and constantly evolved the product based on your feedback. We’ve also invested all revenues back into development and plan to continue as such for the foreseeable future.\n\nWe believe that FitXR is the only at-home fitness product that delivers a unique blend of group fitness, gaming and immersion. All of this translates to an experience that feels more like play than what most people relate to with exercise. To quote one of our members, “it's the best thing to happen to exercise since exercise.”\n\nBy offering FitXR at the lowest subscription price currently available, we’re making it accessible to a broad range of members looking to have fun with their fitness. This is just one way in which FitXR delivers on its promise to bring an unrivaled fitness experience to all, a place where members can meet new people, work out together and achieve that real group, workout experience from the comfort of their homes.\n\nWe hope you enjoy the new updates and features as much as we do. We’re excited to hear from you!\n\nAll our best,\nSam & Sameer",
							"tile_landscape_image": {
								"uri": "https://scontent.oculuscdn.com/v/t64.5771-25/38984472_504618577611663_1866699109711432544_n.png?_nc_cat=102&ccb=1-3&_nc_sid=79b88e&_nc_ohc=pPTYw4lxwLUAX8Rt_BJ&_nc_ht=scontent.oculuscdn.com&oh=2107509eaf6217a75e2ee3683c9061ed&oe=60B507C6"
							}
						}
					]
				},
				"iap_items_2": {
					"edges": [
						{
							"cursor": "AQHRis_LxgIs71rAnT24eXDKm3aXhK3ONjZ6QIQed1gCj_D_LIjuijMavEpWTges-R5vEhKRk1ji8BXTXuqM2UK61A"
						}
					]
				}
			},
			"externalReviewsForDisplay": {
				"nodes": []
			},
			"externalReviewsComplete": {
				"count": 0
			},
			"user_data_disclosure_translated": null,
			"__isItemWithComfortRating": "Application",
			"comfort_rating": "COMFORTABLE_FOR_SOME",
			"is_viewer_subscribed_coming_soon": false,
			"internet_connection": "REQUIRED",
			"internet_connection_name": "需要连接网络",
			"__isItemWithHmdPlatformInformaton": "Application",
			"supported_input_devices_list": [
				{
					"name": "Oculus Touch",
					"tag": "OCULUS_TOUCH"
				}
			],
			"canonicalName": "fitxr-boxvr-android6d0f",
			"viewer_has_preorder": false,
			"purchase_alerts": [],
			"is_granted_on_hardware_registration": false,
			"current_trial_offer": null,
			"extra_buy_box_section": null,
			"is_viewer_entitled": false,
			"baseline_offer": {
				"price": {
					"offset_amount": "0"
				},
				"id": "4503703136310792"
			},
			"__isWishlistableItem": "Application",
			"entry": null,
			"is_demo_of": null,
			"appName": "FitXR — Box and Dance Fitness",
			"platformOffer": null,
			"is_giftable": false,
			"current_gift_offer": null,
			"externalReviews": {
				"count": 0
			},
			"quality_rating_aggregate": 3.2451237809452,
			"support_website_url": "https://fitxr.zendesk.com/hc/en-gb",
			"quality_ratings_by_viewer": [],
			"reviewInfo": {
				"count": 3415,
				"orderings": [
					{
						"key": "top",
						"label": "最相关"
					},
					{
						"key": "most_recent",
						"label": "从新到旧"
					}
				]
			},
			"firstQualityRatings": {
				"count": 3415,
				"page_info": {
					"end_cursor": "AQHR7zd5ndCepPsZUua2nlaTPI1e1bdZJ4FaINRzW0kPFo5Jp_v6zFHKvGXMGEzN3HwGaYQtOzef5X98FymfOA7vqw",
					"start_cursor": "AQHR7zd5ndCepPsZUua2nlaTPI1e1bdZJ4FaINRzW0kPFo5Jp_v6zFHKvGXMGEzN3HwGaYQtOzef5X98FymfOA7vqw"
				},
				"edges": [
					{
						"node": {
							"id": "1178795715889067",
							"author": {
								"id": "461819694253343",
								"display_name": "Pastryvr",
								"profile_photo": {
									"uri": "https://scontent.oculuscdn.com/v/t64.5771-25/q92/c0.0.304.304a/s160x160/38974444_1153576221744350_6935949393194782684_n.jpg?_nc_cat=110&ccb=1-3&_nc_sid=79b88e&_nc_ohc=OQOO_DojCboAX-1MYml&_nc_ht=scontent.oculuscdn.com&tp=28&oh=b70dc0e8b668f648c4d971aebe86212d&oe=60B5C3D4"
								}
							},
							"score": 1,
							"reviewDescription": "Update 4/29: \n     \n   No bugs have been fixed, roughly two weeks into the 90 day trial and it's still broken and missing many features. I still can't use this app properly. Very dissapointed, they also seem to be charging some players already. $120 a year is a bit of a stretch. \n\n   Can't see how the devs can justify charging subscription for this. Games like Audio Trip, Beat Saber, OhShape,  Knockout League, Thrill of the Fight, Pistol Whip, Creed, Dance Central, The Climb, and way more exist on the Quest 2.. you really  need to offer far more for $120/yr.\n\n   I use the quest mainly for fitness, and I'll tell you this... I DON'T play only one app for exercise. I use multiple games per session and I'm pretty sure many others do the same. Just saying... $120/yr to be a beta tester for you, is a bit of a stretch.\n\n   Here's some constructive criticism, make things right with your existing customer base first, you've offended a large portion of users and you need to make things right before expecting them to double/triple dip your app.  Providing the 90 day trial for a beta app is terrible optics. Your userbase is smarter than that. We are potential customers, not unpaid game testers.\n\n    Own up to your mistakes and provide a concise roadmap and detailed description of what existing customers are to expect  once the 90 day trial is over. If you are going to remove DLC, you need to provide a comparable alternative that doesnt require subscription and offer good value for customers before the change .\n\n   Don't try to spin the narrative, its insulting our intelligence. We all know a successful subscription model is far more profitable for you as a company than a one time purchase. Even more so if your customers that paid the initial one time purchase,  agree to an additional subscription fee. We know this has nothing to do with pro consumer choices.\n\n   Spinning this and commenting on how good this change is for the customer is a huge misstep. You might as well say it's for customer \"Pride and Accomplishment\". You know the.. EA response that changed the entire industry.\n\n   Yes I know about sunk cost fallacy and what an open forced trial does for consumer psychology with the rules of reciprocity and all the marketing manipulations. You may fool some but most people see right through this. As demonstrated by all the customer reviews rejecting the 90 day trial.\n\n    In all sincerity, though it may not be your intent, the way you are handling the situation comes off as malice. And trust needs to be reestablished with your existing userbase before you expect us to continue supporting you. Remember, underpromise and over deliver is a good rule to go by.  Can the devs turn things around? I hope so, there is a lot of potential with this app. But sadly it's a total mess atm.\n\n------------\n\n\nResponse to the initial subscription change below.\n\n‐------------\n\nI bought this game 3 weeks ago with the understanding that it's a fitness game with a one time $30 purchase for premade classes w/one time purchase DLC packs. Today it's now free and asking for a $10 subscription. DLC packs have been removed entirely from the store...\n\n  I feel this was completely disingenuous on the part of the developers and there was no transparency regarding this change. Consumers were unable to make informed decisions with the purchase of the game. \n\n   Since I bought this free game plus sub, for $30 three weeks ago, it sits right outside the refund window. And from my understanding I need to pay $10 a month on top of my initial $30, with no one time purchase options for DLC packs.\n\n   There should be greater transparency from the devs. I understand this game would benefit from a subscription model, I just wish the devs made this change more clearly represented to the consumer beforehand. To be absolutely clear, I would have NOT purchased this app for $30 if I knew there were plans to switch the game over to a subscription model. \n\nUpdate 1: \n\n   I keep seeing a copy and paste response from the devs that the subscription is not mandatory. This is misleading and untrue. Prior users purchased the game with the understanding that we may purchase new content as DLC packs in addition to the base game of $30. Now the DLC packs and all future content has been removed and put behind a mandatory monthly subscription.  \n\n   If subscription was not mandatory, why were the DLC packs removed from the store for existing customers? We no longer have access to DLC in the store? \n\n    To see an official dev response trying to spin an obvious anti-consumer update as being pro-consumer is utterly baffling.\n\n   \nUpdate 2: \n\n    Also the game in it's current state is essentially a paid Beta, there are many bugs i.e. earbuds do not work, pause functionality is glitchy, filters are removed. Existing base content is not separated by playlist but buried in a massive song list. New Hiit game mode is absent and multiplayer is not like what you see in Beat Saber, but rather single private room invite only sessions.\n\n   Subscription is automatically enabled for existing players that purchased the game before the update (90 days extended trial), and there is no option to disable it within the oculus app nor the game itself.\n\n   Please Oculus, make an exception for refunds with this game outside the 2 week period. This is a drastic change, without any forewarning to those that purchased prior.",
							"reviewTitle": "Bait and Switch. Disingenuous...",
							"review_helpful_count": 435,
							"review_rank_by_viewer": null,
							"date": 1619754451,
							"developerResponse": {
								"date": 1618595724,
								"body": "Hi Pastryvr, \n\nI wanted to address your points specifically to avoid the criticism of copy and paste responses. \n\nOn point 1 - we are trying to provide our customers with more value not less as a result of this move. The previous DLC packs we $9.99 for 4 classes, our new membership model is $9.99 for a class everyday of the month + all the future upgrades and environments.\n\nOn point 2 - there are a number of known bugs that are being actively worked on at the moment. The HIIT studio is launching in May and we will take all your feedback onboard regarding improvements to multiplayer.",
								"id": "1179287439173228"
							}
						}
					}
				]
			},
			"can_viewer_review": false,
			"is_offer_region_restricted": false,
			"__isWithWebsitePageMeta": "Application",
			"website_page_meta": {
				"description": "FitXR brings fitness studio vibes to your home.\n\nFun workouts designed to burn calories, improve strength and get you high on endorphins.\n\nWorkout with friends in real-time multiplayer.\n\nWith a new workout released every day, we’ve got a class for every goal and fitness level.\n\nDownload now for your 7-day free trial. $9.99/month. Cancel at any time. Terms apply.\n\nVoted Oculus’s best fitness VR game of 2020!",
				"image_height": 405,
				"image_type": "image/jpeg",
				"image_url": "https://scontent.oculuscdn.com/v/t64.5771-25/q92/s720x720/39003274_157380342950899_6486880774862614163_n.jpg?_nc_cat=1&ccb=1-3&_nc_sid=79b88e&_nc_ohc=IMlRnnchTm8AX-44cIm&_nc_ht=scontent.oculuscdn.com&tp=28&oh=83f11dd5312790b072aa6130994347c2&oe=60B5A3F4",
				"image_width": 720,
				"og_locale": "zh_CN",
				"og_type": "website",
				"page_url": "https://www.oculus.com/experiences/quest/2327205800645550/",
				"site_name": "Oculus",
				"title": "FitXR — Box and Dance Fitness · Oculus Quest"
			},
			"fallback_ranking_trace": ""
		}
	}
}