{
	"data": {
		"viewer": {
			"user": null
		},
		"node": {
			"__typename": "Application",
			"__isAppStoreItem": "Application",
			"id": "3484270071659289",
			"display_name": "Star Wars: Tales from the Galaxy's Edge",
			"platform": "ANDROID_6DOF",
			"category": "GAMES",
			"item_bundles": [],
			"__isWithHeroMediaCarousel": "Application",
			"trailer": {
				"thumbnail": {
					"uri": "https://scontent.oculuscdn.com/v/t64.5771-25/q92/s1440x1440/75241704_786126388621532_7199152573861775636_n.jpg?_nc_cat=108&ccb=2&_nc_sid=79b88e&_nc_ohc=erJO_W6kaIcAX8qhuN3&_nc_ht=scontent.oculuscdn.com&tp=28&oh=2a3093d56d26aab2ca5905c2bfd93623&oe=6014004B"
				},
				"uri": "https://scontent.oculuscdn.com/v/t64.7195-25/10000000_3000022216981568_4372684997308199041_n.mp4?_nc_cat=110&ccb=2&_nc_sid=0ed769&_nc_ohc=oG4k6ZziNmIAX-QNMOa&_nc_ht=scontent.oculuscdn.com&oh=9e1a0ac15770cf3d5697f79ee952fbc4&oe=60134B88"
			},
			"quality_rating_histogram_aggregate_all": [
				{
					"star_rating": 1,
					"count": 106,
					"starRating": 1
				},
				{
					"star_rating": 2,
					"count": 120,
					"starRating": 2
				},
				{
					"star_rating": 3,
					"count": 198,
					"starRating": 3
				},
				{
					"star_rating": 4,
					"count": 252,
					"starRating": 4
				},
				{
					"star_rating": 5,
					"count": 658,
					"starRating": 5
				}
			],
			"display_long_description": "Star Wars: Tales from the Galaxy's Edge is an action-adventure experience where you’ll travel to the planet Batuu and get caught up in your own unforgettable story. You’ll fight alongside classic characters like R2-D2 and C-3PO (Anthony Daniels), and face intimidating villains, like Guavian Death Gang cell leader Tara Rashin (Debra Wilson). Visit Seezelslak (Bobby Moynihan) in his cantina to pick up missions that will take you into the wilds of Batuu — or become part of an all-new tale alongside Jedi Master Yoda (Frank Oz) himself.\n\nThe experience takes place on the outskirts of Black Spire Outpost on the planet of Batuu, as depicted in Star Wars: Galaxy's Edge, the immersive epic lands at Disneyland Resort in California and Walt Disney World Resort in Florida. You’ll take on the role of a droid repair technician operating near the planet, but when a group of pirates attack you hit the escape pods and crash on Batuu, where you’ll discover that anyone in the galaxy can become a hero.",
			"developer_privacy_policy_url": "https://privacy.thewaltdisneycompany.com/",
			"developer_terms_of_service_url": "https://disneytermsofuse.com/",
			"supported_player_modes": [
				"SITTING",
				"STANDING",
				"ROOM_SCALE"
			],
			"publisher_name": "Disney Electronic Content, Inc.",
			"supported_in_app_languages": [
				{
					"name": "德语"
				},
				{
					"name": "日语"
				},
				{
					"name": "法语（法国）"
				},
				{
					"name": "英语"
				},
				{
					"name": "西班牙语（墨西哥）"
				},
				{
					"name": "韩语"
				}
			],
			"supported_hmd_platforms": [
				"MONTEREY"
			],
			"supported_input_device_names": [
				"Oculus Touch"
			],
			"user_interaction_mode_names": [
				"单人"
			],
			"age_rating": null,
			"category_name": "游戏",
			"developer_name": "ILMxLAB",
			"genre_names": [
				"动作",
				"冒险",
				"故事"
			],
			"is_360_sensor_setup_required": false,
			"is_concept": false,
			"latest_supported_binary": {
				"__typename": "AndroidBinary",
				"version": "1.0.3+180669.cl.291123",
				"change_log": "What’s new in 1.0.3?\n \nNew Movement Options\nA new Smooth Turning toggle can be found in the Settings menu under the Movement option. When set to ON, this setting allows players using either Free Move or Teleport to turn smoothly rather than snap turning. There is also a new setting for Smooth Turning Speed so that players can customize the speed of smooth turning faster or slower for comfort.\nA new option called Head Oriented Steering has been added to Free Move settings. This toggle is on by default, and means that the player can steer themselves by turning their head while moving forward. When this toggle is turned off, the player can only steer themselves with the controller thumbstick.\n\nAdditional Body Position/Body Type Support and Improved Grab\nThe player torso and the player inventory pouch now both can be adjusted farther from the player’s body for additional comfort.\nWhen the Belt Only toggle is turned ON, the player torso can be adjusted even farther, in both the forward/back and the up/down ranges.  This should allow players in seated positions to move the holsters and All-Kit, so that they can be reached more comfortably. This is meant to support a wider range of reclined seating postures, as well as player heights and body types. (These settings are independent of the Player Height setting in Common Settings, which can be used to adjust the player height in the world.)\nWe have also adjusted the remote grab targeting so that players can target either by pointing their finger, or their palm, at an item they wish to pick up. This should improve the ability for the player to pick up items on the floor without bending over.\n\nChanged All-Kit Tool Stowing Method\nIf the All-Kit tool is dropped in midair or over the inventory pouch, it will automatically snap to its holster.  Auto-stowing in the inventory pouch has been prevented.\nIf you wish to put the All-Kit Tool into your inventory, you still can!  Just open the inventory by pulling the pouch off your chest, and stow the All-Kit directly into an inventory slot of your choice.\n\nInventory LT/RT to Expand/Collapse\nText has been added to clarify that LT or RT can be used to expand/collapse the inventory when open.\nAdjustments have been made to reduce accidental pickup of items when attempting to expand or collapse the inventory.\n\nFixes:\nStability improvements.\nFixed hands becoming invisible during level transition/respawn.\nAim improvements/weapon tuning.\nCompass fixes.\nAudio mix adjustments for J-4X, C-3PO holocalls, other items.\nLooping adjustments for music.\nPrevented a case in Mubo’s Cargo Transport where player could restore behind a closed door.\nPrevented a case in Hissiq Springs where certain configurations of enemy spawns could prevent player progression.\nFixed a rare case of losing the All-Kit tool when pausing during return to belt.\nImproved compass behavior across multiple missions.\nPrevented combat from starting during loading screen.\nFixed issue where current item state would not be properly saved in certain scenarios.\nFixed issues around lightsaber penetrating ground in smooth loc mode.\nFixed an issue where enemies would rarely briefly show a visual glitch on death.\nPrevented a situation where flying enemies could leave player range.\nFixed several instances of visual holes in geometry in various locations.\nFixed a controller “dead zone” in smooth locomotion mode.\nFixed Seeker droid shots continuing after seeker droid destruction in certain cases.\nFixed E-Web audio cutting out in certain situations.\nRemoved errant collision for destroyed E-Web in Splintered Spire.\nFixed missing credits reward when completing “Darkness In Us All.”\nFixed rare issue with Seezelslak animation popping after completing Temple of Darkness.\nFixed rare issue with pirate bodies flying midair post-death.\nFixed player teleport distance reduction when teleporting with left hand during scan.\nFixed missing Viper droid combat chatter.\nRestored VFX for remote droid destruction in Mubo’s Workshop.\nPrevented overlapping VO when throwing multiple remotes during Mubo’s remote intro.\nFixed issue which allowed credits to be duplicated in certain situations.\nFixed cinematic issues caused by restoring Threepio’s eye at unexpected times.\nFixed incorrect opening color coding in dial puzzle.\nFixed a rare bug where weapons and held items could become invisible if vented during menu open.\nPrevent low health beep from playing during final Splintered Spire cutscene.\nEnsured ammo meter is visible on shotgun while holstered.\n\n1.0.2\nFixed a rare case where the All-Kit tool could be lost by dropping it just after unscrewing a bolt.\nFailsafe to ensure player will always have an All-Kit tool once it’s initially found.\nFailsafe to ensure a player with no weapons and an empty holster will always have a pistol after level transition or load.\n\n1.0.1 \nFixed a rare issue where player could load outside the playable space in Mubo’s Workshop when moving during level transition.\nFixed audio glitches during combat in Hissiq Springs fighting viper droids.\nFixed an issue where Bacta sprays could be dropped midair.\nFixed an issue where changing the active mission when the compass was in inactive mode resulted in compass not functioning properly.\nFixed three bar puzzle functionality and visual issues.\nFixed misplaced cover points in various maps.\nFixed various issues with Cargo Vessel animation in Mubo’s Cargo Transport\nFixed prioritization of Cantina Problem with Porgs mission in certain scenarios.\nFixed J-4X video cutting out if player paused at very start of game.\nFixed an instance of “Pieces of the Pilot” mission arrow pointing incorrectly in Splintered Spire.\nFixed heavy blaster ammo indicator not appearing when holstered.\n",
				"supported_hmd_types": [
					"MONTEREY"
				],
				"total_installed_space": "6091735649",
				"id": "3640474756038819",
				"required_space_adjusted": "9223896965",
				"storeAddOns": {
					"__typename": "AndroidBinaryStoreAddonsIncludingBundlesConnection",
					"count": 0
				},
				"firstIapItems": {
					"__typename": "AndroidBinaryStoreAddonsIncludingBundlesConnection",
					"page_info": {
						"end_cursor": null,
						"start_cursor": null
					},
					"count": 0,
					"edges": []
				}
			},
			"recommended_graphics": null,
			"recommended_memory_gb": null,
			"recommended_processor": null,
			"release_date": 1605790503,
			"supported_tracking_modes": [],
			"website_url": "https://www.ilmxlab.com/",
			"current_offer": {
				"__typename": "AppStoreOffer",
				"offer_type": "APPSTORE_OFFER",
				"id": "211173747259997",
				"__isPurchasableOfferWithApp": "AppStoreOffer",
				"price": {
					"currency": "USD",
					"offset_amount": "2499",
					"formatted": "$24.99"
				},
				"strikethrough_price": null,
				"promo_benefit": null,
				"end_time": 0,
				"show_timer": false,
				"buy_button_captions": []
			},
			"viewer_release_channel": {
				"id": "635424004003991"
			},
			"live_release_channel": {
				"id": "635424004003991",
				"channel_name": "LIVE",
				"latest_supported_binary": {
					"__typename": "AndroidBinary",
					"id": "3640474756038819"
				}
			},
			"release_channels": {
				"count": 1,
				"nodes": [
					{
						"channel_name": "LIVE",
						"id": "635424004003991",
						"latest_supported_binary": {
							"__typename": "AndroidBinary",
							"version": "1.0.3+180669.cl.291123",
							"id": "3640474756038819"
						}
					}
				]
			},
			"grouping": {
				"upcoming_events": {
					"edges": []
				},
				"id": "366735464642265",
				"posts": {
					"nodes": []
				},
				"iap_items_2": {
					"edges": []
				}
			},
			"externalReviewsForDisplay": {
				"nodes": []
			},
			"externalReviewsComplete": {
				"count": 0
			},
			"user_data_disclosure_translated": null,
			"__isItemWithComfortRating": "Application",
			"comfort_rating": "COMFORTABLE_FOR_MOST",
			"is_viewer_subscribed_coming_soon": false,
			"internet_connection": "REQUIRED_FOR_DOWNLOAD",
			"internet_connection_name": "下载内容需要连接网络",
			"__isItemWithHmdPlatformInformaton": "Application",
			"supported_input_devices_list": [
				{
					"name": "Oculus Touch",
					"tag": "OCULUS_TOUCH"
				}
			],
			"canonicalName": "ilmxlab-tales-android6d0f",
			"viewer_has_preorder": false,
			"purchase_alerts": [],
			"is_granted_on_hardware_registration": false,
			"current_trial_offer": null,
			"extra_buy_box_section": {
				"content": "Oculus 退款政策",
				"link_uri": "https://www.oculus.com/legal/quest-rift-content-refund-policy/"
			},
			"is_viewer_entitled": false,
			"baseline_offer": {
				"price": {
					"offset_amount": "2499"
				},
				"id": "211173747259997"
			},
			"__isWishlistableItem": "Application",
			"entry": null,
			"is_demo_of": null,
			"appName": "Star Wars: Tales from the Galaxy's Edge",
			"platformOffer": null,
			"is_giftable": true,
			"current_gift_offer": {
				"__typename": "AppStoreOffer",
				"id": "211173747259997"
			},
			"externalReviews": {
				"count": 0
			},
			"quality_rating_aggregate": 3.9265367316342,
			"support_website_url": "https://support.starwars.com/",
			"quality_ratings_by_viewer": [],
			"reviewInfo": {
				"count": 728,
				"orderings": [
					{
						"key": "top",
						"label": "最相关"
					},
					{
						"key": "most_recent",
						"label": "从新到旧"
					}
				]
			},
			"firstQualityRatings": {
				"count": 728,
				"page_info": {
					"end_cursor": "AQHRhHOLa4LJcLO4Furmg3qlXQpcxMbJ5x-tMBLZ7nLo5Ohbh3GiIXy4JFxHHNhgGqtDNQnnT3BinvbjWJHNXyrhqQ",
					"start_cursor": "AQHRhHOLa4LJcLO4Furmg3qlXQpcxMbJ5x-tMBLZ7nLo5Ohbh3GiIXy4JFxHHNhgGqtDNQnnT3BinvbjWJHNXyrhqQ"
				},
				"edges": [
					{
						"node": {
							"id": "2880289122290175",
							"author": {
								"id": "1906066799712417",
								"display_name": "Kevin_Brook",
								"profile_photo": {
									"uri": "https://scontent.oculuscdn.com/v/t64.5771-25/q92/c0.0.639.639a/s160x160/11162741_1906066976379066_460409907036815360_n.jpg?_nc_cat=101&ccb=2&_nc_sid=79b88e&_nc_ohc=Wk3FJXBY-FMAX-gY3xz&_nc_ht=scontent.oculuscdn.com&tp=28&oh=7589c9ca478c541d440957fff04732c3&oe=601387F6"
								}
							},
							"score": 4,
							"reviewDescription": "I was given early access to this game to review for VRFitness Insider. For a Quest 2 game it really has the visual wow factor, and runs smoothly enough that it could easily pass as a PCVR title. I loved the gunplay and the attack droids, and the All-Kit multi tool sections were fun and added variety to the experience.\n\nThe game's production values are very quality, it's just a shame it's not very long. It took me a couple hours to beat the main quest, although the game continues past that and you still have some side missions and achievements to unlock. I'd say there's about 5 or 6 hours of content here, and it's fun enough that I could happily replay it on a harder difficulty.\n\nI look forward to the next one in the series.\n\nYou can check out my full review below\n\nhttps://www.vrfitnessinsider.com/star-wars-tales-from-the-galaxys-edge-vr-review-blast-your-way-through-this-brief-but-brilliant-adventure/",
							"reviewTitle": "Great fun whilst it lasts",
							"review_helpful_count": 1167,
							"review_rank_by_viewer": null,
							"date": 1605802076,
							"developerResponse": null
						}
					}
				]
			},
			"can_viewer_review": false,
			"is_offer_region_restricted": false,
			"__isWithWebsitePageMeta": "Application",
			"website_page_meta": {
				"description": "Star Wars: Tales from the Galaxy's Edge is an action-adventure virtual reality experience that lets you travel across the galaxy to the planet of Batuu and live out your own unforgettable story. You’ll fight alongside classic characters, and face intimidating villains, as you explore all-new regions and eras of the Star Wars galaxy. With different styles of gameplay and multiple difficulty settings, Tales from the Galaxy’s Edge appeals to Star Wars fans and VR gamers alike.",
				"image_height": 405,
				"image_type": "image/jpeg",
				"image_url": "https://scontent.oculuscdn.com/v/t64.5771-25/q92/s720x720/38982547_801231837114161_6127919994528410984_n.jpg?_nc_cat=1&ccb=2&_nc_sid=79b88e&_nc_ohc=IOzLLVxBaQYAX-dlvQM&_nc_ht=scontent.oculuscdn.com&tp=28&oh=06227d0208181eb6ff9e4047f367bfc7&oe=6011E08C",
				"image_width": 720,
				"og_locale": "zh_CN",
				"og_type": "website",
				"page_url": "https://www.oculus.com/experiences/quest/3484270071659289/",
				"site_name": "Oculus",
				"title": "Star Wars: Tales from the Galaxy's Edge · Oculus Quest"
			},
			"fallback_ranking_trace": ""
		}
	}
}