{
	"data": {
		"viewer": {
			"user": null
		},
		"node": {
			"__typename": "Application",
			"__isAppStoreItem": "Application",
			"id": "2307085352735834",
			"display_name": "Blaston",
			"platform": "ANDROID_6DOF",
			"category": "GAMES",
			"item_bundles": [
				{
					"id": "2897778483786372",
					"__isAppStoreItem": "AppItemBundle",
					"__typename": "AppItemBundle",
					"display_name": "友情对峙",
					"current_offer": {
						"__typename": "AppStoreOffer",
						"price": {
							"formatted": "$22.99"
						},
						"strikethrough_price": {
							"formatted": "$29.98"
						},
						"id": "316398866346009"
					},
					"cover_landscape_image": {
						"uri": "https://scontent.oculuscdn.com/v/t64.5771-25/q92/s100x100/75221326_823612138196525_4052922939630269652_n.jpg?_nc_cat=1&ccb=2&_nc_sid=79b88e&_nc_ohc=tF-hcfQBDQYAX_HmTGv&_nc_ht=scontent.oculuscdn.com&tp=28&oh=e6a3fde6d53446c3fe2c489806909cd3&oe=601E7DB8"
					},
					"cover_square_image": null,
					"is_viewer_entitled": false,
					"bundle_items": {
						"count": 2
					}
				}
			],
			"__isWithHeroMediaCarousel": "Application",
			"trailer": {
				"thumbnail": {
					"uri": "https://scontent.oculuscdn.com/v/t64.5771-25/q92/s1440x1440/39031399_270889964059095_1801547555515149045_n.jpg?_nc_cat=102&ccb=2&_nc_sid=79b88e&_nc_ohc=0GAKazHrI7kAX8rfccg&_nc_ht=scontent.oculuscdn.com&tp=28&oh=af6b324c380421a8eb64048c58641c8c&oe=601F6FA8"
				},
				"uri": "https://scontent.oculuscdn.com/v/t64.7195-25/10000000_668112323909051_8698669230012796472_n.mp4?_nc_cat=105&ccb=2&_nc_sid=0ed769&_nc_ohc=cgJohfKB-U4AX9CnMRa&_nc_ht=scontent.oculuscdn.com&oh=f2bfc1c035c26d46d06db48ef8cd3ad4&oe=60213481"
			},
			"quality_rating_histogram_aggregate_all": [
				{
					"star_rating": 1,
					"count": 12,
					"starRating": 1
				},
				{
					"star_rating": 2,
					"count": 7,
					"starRating": 2
				},
				{
					"star_rating": 3,
					"count": 7,
					"starRating": 3
				},
				{
					"star_rating": 4,
					"count": 67,
					"starRating": 4
				},
				{
					"star_rating": 5,
					"count": 585,
					"starRating": 5
				}
			],
			"display_long_description": "UPDATE: Snowball weapon, spectator mode, new skin, new Ozo lounge, and more!\n\n“One of the Best VR Experiences of 2020.” 5/5 Review - TheGamer\n\n“Must Buy” - VRScout\n\nEnter the Arena!\nDuel players and bots to rise to the top League with your loadout assembled from collected weapons. The competitive game of endless skill depth you were looking for from the makers of Acron, Cook-Out & Angry Birds VR.\n\nIn this slow motion bullet-hell, you duck, dodge and weave to evade incoming attacks while preparing your dazzling next combos in a flash of skill. You feel like Neo and leave each session with your heart racing - super fun tactical workout.\n\n● Duel players in real-time from around the world\n● Level-up to collect weapons of increasing depth\n● Balance your weapons’ spawn time & their role\n● Learn new tricks, add them to your strategy & play style\n● Track the meta tweaked every month\n● Play friends in private duels (single account ok)\n● Join a community of players for tips, practice & friends!",
			"developer_privacy_policy_url": "https://www.resolutiongames.com/privacy",
			"developer_terms_of_service_url": "https://www.resolutiongames.com/terms-of-use",
			"supported_player_modes": [
				"STANDING",
				"ROOM_SCALE"
			],
			"publisher_name": "Resolution Games",
			"supported_in_app_languages": [
				{
					"name": "中文（简体）"
				},
				{
					"name": "俄语"
				},
				{
					"name": "德语"
				},
				{
					"name": "日语"
				},
				{
					"name": "法语（法国）"
				},
				{
					"name": "瑞典语"
				},
				{
					"name": "英语"
				},
				{
					"name": "西班牙语（哥伦比亚）"
				},
				{
					"name": "西班牙语（墨西哥）"
				},
				{
					"name": "西班牙语（委内瑞拉）"
				},
				{
					"name": "西班牙语（智利）"
				},
				{
					"name": "西班牙语（波多黎各）"
				},
				{
					"name": "西班牙语（秘鲁）"
				},
				{
					"name": "西班牙语（阿根廷）"
				},
				{
					"name": "韩语"
				}
			],
			"supported_hmd_platforms": [
				"MONTEREY"
			],
			"supported_input_device_names": [
				"Oculus Touch"
			],
			"user_interaction_mode_names": [
				"多人",
				"单人"
			],
			"age_rating": null,
			"category_name": "游戏",
			"developer_name": "Resolution Games",
			"genre_names": [
				"动作",
				"射击",
				"体育"
			],
			"is_360_sensor_setup_required": false,
			"is_concept": false,
			"latest_supported_binary": {
				"__typename": "AndroidBinary",
				"version": "1.5.99686",
				"change_log": "",
				"supported_hmd_types": [
					"MONTEREY"
				],
				"total_installed_space": "382652670",
				"id": "3368544976589861",
				"required_space_adjusted": "624066802",
				"storeAddOns": {
					"__typename": "AndroidBinaryStoreAddonsIncludingBundlesConnection",
					"count": 0
				},
				"firstIapItems": {
					"__typename": "AndroidBinaryStoreAddonsIncludingBundlesConnection",
					"page_info": {
						"end_cursor": null,
						"start_cursor": null
					},
					"count": 0,
					"edges": []
				}
			},
			"recommended_graphics": null,
			"recommended_memory_gb": null,
			"recommended_processor": null,
			"release_date": 1602176400,
			"supported_tracking_modes": [],
			"website_url": "http://blaston.com/",
			"current_offer": {
				"__typename": "AppStoreOffer",
				"offer_type": "APPSTORE_OFFER",
				"id": "368072897669349",
				"__isPurchasableOfferWithApp": "AppStoreOffer",
				"price": {
					"currency": "USD",
					"offset_amount": "999",
					"formatted": "$9.99"
				},
				"strikethrough_price": null,
				"promo_benefit": null,
				"end_time": 0,
				"show_timer": false,
				"buy_button_captions": []
			},
			"viewer_release_channel": {
				"id": "2379584879036490"
			},
			"live_release_channel": {
				"id": "2379584879036490",
				"channel_name": "LIVE",
				"latest_supported_binary": {
					"__typename": "AndroidBinary",
					"id": "3368544976589861"
				}
			},
			"release_channels": {
				"count": 1,
				"nodes": [
					{
						"channel_name": "LIVE",
						"id": "2379584879036490",
						"latest_supported_binary": {
							"__typename": "AndroidBinary",
							"version": "1.5.99686",
							"id": "3368544976589861"
						}
					}
				]
			},
			"grouping": {
				"upcoming_events": {
					"edges": []
				},
				"id": "2706841829336579",
				"posts": {
					"nodes": [
						{
							"id": "865063720910037",
							"title": "Holly Jolly December Update",
							"created_time": 1607963964,
							"body_text": "The end of the year is drawing in closer and we’ve set out to end this one on a high note. We can’t leave you without a big gift right before the holidays and as they say, good things come in threes:\n\nSpectator mode - After many, maaany player requests it’s finally done! It’s currently in its infancy with more updates to come. Spectator mode currently allows up to eight players to watch live friendly matches via a room code.\n\nOzo Lounge - The doors have opened and we’re inviting all players in Visit the lounge to hang out and chat to other players, fistbump to start a friendly match or spectate a duel started from the Lounge. Say hi to the bartender from us!\n\nPlay against duelists on Steam - With the launch of Blaston on Steam, you can now battle your PCVR-using friends. You’ll all be part of the same matchmaking system, so it’s time to show them who’s boss.\n\nWe hope you will enjoy these updates and are looking forward to another amazing year with all of you Blasters out there.\n\nHappy holidays,\nThe Blaston Team",
							"tile_landscape_image": {
								"uri": "https://scontent.oculuscdn.com/v/t64.5771-25/38984472_803118000268826_8616380140568698945_n.png?_nc_cat=102&ccb=2&_nc_sid=79b88e&_nc_ohc=dlxv9HxM0r4AX8c1amU&_nc_ht=scontent.oculuscdn.com&oh=400df40c93bdbf4064a99cfbe694457c&oe=602171B0"
							}
						},
						{
							"id": "131808951730815",
							"title": "November Update is here!",
							"created_time": 1605801599,
							"body_text": "Hey all Duelists, we’re hyped to release the first of many feature updates. We do our best to listen to your feedback while crafting the next stage. This community has blown past our dreams in skills, sportsmanship and dedication. This boosts us every single morning (along with coffee). See you soon in there... with a Quicksilver in hand, obviously ;)\n\n-New customizations: New weapon, new character and new skins\n-Lounge soft opening \n-Voice chat when playing friendly matches\n-Effects when fist bumping or high five between players\n-Localization: French, Japanese, Simplified Chinese, Russian, German, Korean, Spanish, Swedish\n-New Home Room scene, where the player will access the menu, do onboarding\n-A new Tool called Tether that increases the speed of projectiles when used in conjunction with a projectile tool\n-Haptic and sound when grabbing tools\n-Matchmaking improvements\n-Increased the max level 23\n-Added an end of season notification\n-Abandoned theater optimizations\n-Improved error handling\n-General visual improvements\n-Improved throwing\n-Improved time to play\n-Tips for the user\n-Tool spawn improvements\n-Bug fixes: Fixed bug that prevented players on South African servers from creating working friendly games and participating in some duels. Additional bug fixes",
							"tile_landscape_image": null
						}
					]
				},
				"iap_items_2": {
					"edges": [
						{
							"cursor": "AQHRjYaAg_Th_ZMVgrwgJbC0luD4n7_hmJm6wfjwmFvyyhDvjUk-Ad4UD3ndIZpJNJh1PMcN10esK6s_rjZA_s545A"
						}
					]
				}
			},
			"externalReviewsForDisplay": {
				"nodes": []
			},
			"externalReviewsComplete": {
				"count": 0
			},
			"user_data_disclosure_translated": null,
			"__isItemWithComfortRating": "Application",
			"comfort_rating": "COMFORTABLE_FOR_MOST",
			"is_viewer_subscribed_coming_soon": false,
			"internet_connection": "REQUIRED",
			"internet_connection_name": "需要连接网络",
			"__isItemWithHmdPlatformInformaton": "Application",
			"supported_input_devices_list": [
				{
					"name": "Oculus Touch",
					"tag": "OCULUS_TOUCH"
				}
			],
			"canonicalName": "resolution-games-ignis-android6d0f",
			"viewer_has_preorder": false,
			"purchase_alerts": [],
			"is_granted_on_hardware_registration": false,
			"current_trial_offer": null,
			"extra_buy_box_section": {
				"content": "Oculus 退款政策",
				"link_uri": "https://www.oculus.com/legal/quest-rift-content-refund-policy/"
			},
			"is_viewer_entitled": false,
			"baseline_offer": {
				"price": {
					"offset_amount": "999"
				},
				"id": "368072897669349"
			},
			"__isWishlistableItem": "Application",
			"entry": null,
			"is_demo_of": null,
			"appName": "Blaston",
			"platformOffer": null,
			"is_giftable": true,
			"current_gift_offer": {
				"__typename": "AppStoreOffer",
				"id": "368072897669349"
			},
			"externalReviews": {
				"count": 0
			},
			"quality_rating_aggregate": 4.7787610619469,
			"support_website_url": "https://www.resolutiongames.com/support",
			"quality_ratings_by_viewer": [],
			"reviewInfo": {
				"count": 466,
				"orderings": [
					{
						"key": "top",
						"label": "最相关"
					},
					{
						"key": "most_recent",
						"label": "从新到旧"
					}
				]
			},
			"firstQualityRatings": {
				"count": 466,
				"page_info": {
					"end_cursor": "AQHRBnX5WugOhT6xIJsWpbhSpGrgDDfw9T4p_FjNQ4jP4nKfPyvcYGNxs6ajGvJ-UpTrYeL3YtSfTEt9XXXX1seNtw",
					"start_cursor": "AQHRBnX5WugOhT6xIJsWpbhSpGrgDDfw9T4p_FjNQ4jP4nKfPyvcYGNxs6ajGvJ-UpTrYeL3YtSfTEt9XXXX1seNtw"
				},
				"edges": [
					{
						"node": {
							"id": "379709853344470",
							"author": {
								"id": "102449307737194",
								"display_name": "Tomm408",
								"profile_photo": {
									"uri": "https://scontent.oculuscdn.com/v/t64.5771-25/q92/c0.0.304.304a/s160x160/75203621_353267665988689_5326157043711580404_n.jpg?_nc_cat=106&ccb=2&_nc_sid=79b88e&_nc_ohc=vk7Xx0KDQS4AX9zT2oQ&_nc_ht=scontent.oculuscdn.com&tp=28&oh=219f89a00b070569300ffcd1cfc6c9a0&oe=601F9693"
								}
							},
							"score": 5,
							"reviewDescription": "Blaston is an amazing, competitive PvP game. However, it can be a little confusing when you first start, because some of the important mechanics aren’t very obvious. I wrote this guide to try and clarify those mechanics, so that you can launch straight into enjoying this brilliant game, with minimal confusion :)\n\nWeapon Stats:\nGuns have an ‘hp’ and ‘collision’ stat. Hp tells you how much health that gun’s bullets have. Collision tells you how much damage the bullets do to OTHER BULLETS. Your own bullets don’t collide, so you can shoot through your shields / your novas (the big pink balls). This can be a good way of hiding your shots.\n- you’ll notice weapons and shields have a set of hp/collision stats under ‘THROW’ too. This refers to when you throw the gun, or handle of the shield. To be clear about this: if you activate a shield and it hits the enemy/enemy bullets whilst it’s active, it will use the normal hp/collision stats. But if you throw the handle of your shield (so a non active shield or a shield that’s run out), it will then use the THROW stats. This is a bit counter intuitive but throwing an active shield is definitely a good way of clearing up enemy bullets :)\n\nDealing with Novas (the big pink balls):\n- The easiest way to deal with these is to pop your shield and THROW it at them (if you don’t throw you might accidentally touch the nova with your hand and take 40 damage). You can kill two Novas with a thrown shield. Shotguns will kill novas in one blast too. Get rid of them so you have room to move.\n- If your nova collides with an enemy nova they will pass through each other and only have a TINY bit of health left. Shoot or throw a weapon at the ‘injured’ nova to quickly kill it.\n\nYou must learn to control your in-game torso to dodge properly. Here’s how:\n       - Whilst in the Main Menu or Load Out menu, press the Oculus Menu Button to get a third person view of your character. Your character will freeze in the position they were in when you pressed the button. Get into different positions and use this feature to build an understanding of how your body is behaving in game. Here are the basics:\n\t- The direction you are LOOKING determines the direction of your torso. If you turn more than 45* left or right (or down), you body will start to turn with your head. Looking side on at certain moments is KEY to dodging properly.\n\t- Your head can touch the floor but your body can’t. You can only duck so low before your body won’t go lower.\n\t- You only take damage for being out of bounds if your HEAD is out of bounds (little green hexagons appear when you’re close to the boundary - be careful not to cross your head over them or you’ll die very quickly). You can turn your body away, so that it’s protruding out of bounds. Looking straight down means your body will move a bit out behind you, which can be useful in a pinch. Your hands can go out of bounds which can be useful for getting a gun close to your opponent for a quick shot.\n \t- Jumping is a thing, and occasionally it can save the day.\n\nBots:\n- You will often be placed against a bot whilst waiting for a player. You know it’s a bot when its head tracks you perfectly during the countdown before start of the game. Your game against a bot will be interrupted when a real player is found. If you have more hp(or equal) to the bot at the time of interruption you will win the game. Otherwise you lose, so try to get some damage on them quickly. Don’t worry if you lose a few points to an interrupted bot match. It happens and is no big deal.\n\nMechanics of guns spawning: \n- When you look at a gun in the load out menu, they have a time next to their icon (e.g. 1s or 5s). This tells you how long, on average, it will take that gun to respawn when you grab it. You have a total ‘time bank’ of 25 seconds at any one time. ‘Powerful’ guns take up more time (e.g. 7s), so you can’t have many spawn at once, or you’ll exceed 25s, and guns will stop spawning until you drop below 25s. You can see this happening when a gun that is trying to spawn in goes red and stops spawning - grab and use a gun that’s already there, and the red one will change to green, and continue to spawn. For this reason many good players have a mix of short-respawn guns, and longer-respawn guns, otherwise they’ll always be waiting around for ages without any guns. \n\nPatience pays off:\n- As you start to climb the rankings, you’ll notice that people often wait for a combo of certain guns to spawn (e.g. wait for 2 red vipers or 2 Novas to spawn), so they just dodge about a bit / shoot their smaller weapons at you until they have 2 good weapons available at once, then they’ll grab those and try to ruin your day. This sort of waiting can be really powerful, as often it’s the combination of guns that will allow you to pin your opponent into a corner and actually get some hits on them. This doesn’t mean you should always just wait around like a lemon, but just be aware that always frantically grabbing and shooting everything as quickly as possible isn’t always your best option. \n\nShooting in two places at once:\n- Often you need to be shooting AT your opponent with one hand, and shooting where they’re going to GO with the other hand. Shooting at them makes them move, then shooting to their side means there will be some bullets waiting for them.\n\n‘Hey - that guy has a gun I don’t have yet!’\n- Don’t panic. Guns are NOT unlocked in power order. I promise you that by the time you’re playing at a good enough level for the guns you’re using to matter at all, you’ll have unlocked all the best guns that the top players use, because they’re unlocked really early on. To be clear, some of the guns you unlock late on (purple laser / white ‘energy cage’ guns) seem really cool/unfair when you first come across them, but you’ll find you probably don’t stick with them when you unlock them yourself, because they’re just not that effective against experienced players. \n\nGrenades:\n- Grenades can be overwhelming, but throwing a shield at them just before/ just as they explode is a great way of dealing with them (just try not to get shot if you turn away from your opponent). \n- At the exact moment a grenade explodes, its projectiles will move in a straight line towards you, spreading out as they go. You’ll notice that more experienced players are very good at dodging the grenade’s projectiles, because they stand on one side (often on the same side the grenade), and then move to the other side right after the explosion, dodging all the pellets.\n\nLasers:\n- lasers may seem overpowered, but they’re more scary than they are powerful. The first few times you’ll panic and die, but 10 games later you’ll stop finding them such a big problem. They don’t start dealing damage until about a second after they appear, so you have a long moment’s grace before you need to move. Against bots with lasers, just hop over to the extreme side of your podium whilst they set them up, then you can move over and use the rest of your space for a few seconds until they’re gone. Often, somebody with double lasers won’t have any other guns spawned because the lasers most of their time bank. Also remember it’s often worth jumping through a laser very quickly rather than getting hemmed in and shot by a red viper or similar. You might also pop a shield to absorb the damage as you move for extra IQ points.\n\nGuns where you can curve their bullets:\n- Currently there are three guns that you can curve the bullets of: the yellow shotgun, the Viper Ellipse with the square end to the barrel, and a short little pistol that looks like a scanner. All are unlocked quite early on. It’s hard to describe how to curve bullets, but notice that all these guns have a glowing trail when you wave them about. The length of that glowing trail indicates how curved, and what direction, your shots are going to go in. Play around in the load out area when you unlock them. For a better explanation search ‘Wudi Plays Blaston’, as he does a clear video on it.\n\nThat’s everything! Good luck, give me a wave if you catch me game (I am ‘TomNum2’), and please give this review a thumbs up so it stays on the front page / is obvious to the newcomers :)\n\n——————- Note —————-\nEverything is correct at the time of writing, but if I update the guide, all the upvotes get wiped, so I won’t be able to make any revisions if something gets changed in a later patch. Sorry about that.",
							"reviewTitle": "A guide for new players",
							"review_helpful_count": 932,
							"review_rank_by_viewer": null,
							"date": 1605864410,
							"developerResponse": {
								"date": 1605879250,
								"body": "Thank you so much for this detailed and elaborate review. Lots of great tips for new players!",
								"id": "379982256650563"
							}
						}
					}
				]
			},
			"can_viewer_review": false,
			"is_offer_region_restricted": false,
			"__isWithWebsitePageMeta": "Application",
			"website_page_meta": {
				"description": "Do you have what it takes to rise the ranks and be this season’s champion in Resolution Games’ fiercely competitive VR dueling game?\n\nJoin the growing community and compete within the slow motion bullet-hell of Blaston, which The Gamer calls “One of the Best VR Experiences of 2020.” Prepare to continuously dodge, duck and weave to evade incoming attacks from your opponent in this FPS PvP combat game that combines skill, strategy & speed with an incredible arsenal of futuristic high-tech weapons.",
				"image_height": 405,
				"image_type": "image/jpeg",
				"image_url": "https://scontent.oculuscdn.com/v/t64.5771-25/q92/s720x720/38982699_203985381341357_6512892825908090705_n.jpg?_nc_cat=106&ccb=2&_nc_sid=79b88e&_nc_ohc=MQ_RlBAq7ooAX9T9nh7&_nc_ht=scontent.oculuscdn.com&tp=28&oh=eb20edcaa2b512a5da3b39fdaaa00df6&oe=60203EF6",
				"image_width": 720,
				"og_locale": "zh_CN",
				"og_type": "website",
				"page_url": "https://www.oculus.com/experiences/quest/2307085352735834/",
				"site_name": "Oculus",
				"title": "Blaston · Oculus Quest"
			},
			"fallback_ranking_trace": ""
		}
	}
}