{
	"data": {
		"viewer": {
			"user": null
		},
		"node": {
			"__typename": "Application",
			"__isAppStoreItem": "Application",
			"id": "2228678273856228",
			"display_name": "Espire 1: VR Operative",
			"platform": "ANDROID_6DOF",
			"category": "GAMES",
			"item_bundles": [],
			"__isWithHeroMediaCarousel": "Application",
			"trailer": {
				"thumbnail": {
					"uri": "https://scontent.oculuscdn.com/v/t64.5771-25/q92/s1440x1440/38974603_1240628822791920_5956410888343781376_n.jpg?_nc_cat=108&ccb=3&_nc_sid=79b88e&_nc_ohc=BtKSec0unagAX_7dqqe&_nc_ht=scontent.oculuscdn.com&tp=28&oh=65ec1c4c4227df4c2d6b5a421ae5c770&oe=604A53BE"
				},
				"uri": "https://scontent.oculuscdn.com/v/t64.7195-25/10000000_1240628392791963_2019644126823186432_n.mp4?_nc_cat=107&ccb=3&_nc_sid=0ed769&_nc_ohc=5WvPlZwfRlMAX-Imvgv&_nc_ht=scontent.oculuscdn.com&oh=79c956caa43593136962dd8990361c43&oe=604C7456"
			},
			"quality_rating_histogram_aggregate_all": [
				{
					"star_rating": 1,
					"count": 128,
					"starRating": 1
				},
				{
					"star_rating": 2,
					"count": 105,
					"starRating": 2
				},
				{
					"star_rating": 3,
					"count": 209,
					"starRating": 3
				},
				{
					"star_rating": 4,
					"count": 515,
					"starRating": 4
				},
				{
					"star_rating": 5,
					"count": 1255,
					"starRating": 5
				}
			],
			"display_long_description": "**Now including our 1.7 Anniversary Update with enhancements for Quest 1 & 2 users.**\n\nWith Espire 1, we're delivering VR's definitive Stealth Experience. Gone are the days of watching a super-spy hero on-screen: by leveraging the head and hand-tracked capabilities of current VR technology, players can physically live out their 007 fantasies as the Espire Model 1 Operative. These stealth mechanics cannot be replicated on another medium. \n\nPlayers assume the role of an Espire Agent - a drone operator of the future. From the safety of their \"Espire Control Theatre\" (sized to their Oculus Guardian Boundaries) they deploy the Espire Model 1 operative on assignments around the globe. The player then remote-operates Espire 1 from thousands of Kilometres away - the player's movement is translated 1:1 into that of Espire.. The \"Control Theatre\" mechanic is not only a story component; it is used to minimize VR sickness whenever the player performs artificial movement.",
			"developer_privacy_policy_url": "http://thelode.com.au/privacy-policy/",
			"developer_terms_of_service_url": null,
			"supported_player_modes": [
				"SITTING",
				"STANDING",
				"ROOM_SCALE"
			],
			"publisher_name": "Tripwire Interactive",
			"supported_in_app_languages": [
				{
					"name": "德语"
				},
				{
					"name": "日语"
				},
				{
					"name": "法语（法国）"
				},
				{
					"name": "英语"
				},
				{
					"name": "西班牙语（西班牙）"
				},
				{
					"name": "韩语"
				}
			],
			"supported_hmd_platforms": [
				"MONTEREY"
			],
			"supported_input_device_names": [
				"Oculus Touch"
			],
			"user_interaction_mode_names": [
				"单人"
			],
			"age_rating": null,
			"category_name": "游戏",
			"developer_name": "Digital Lode",
			"genre_names": [
				"动作",
				"故事",
				"射击"
			],
			"is_360_sensor_setup_required": false,
			"is_concept": false,
			"latest_supported_binary": {
				"__typename": "AndroidBinary",
				"version": "1.7.218",
				"change_log": "",
				"supported_hmd_types": [
					"MONTEREY"
				],
				"total_installed_space": "4018164928",
				"id": "3823537634370276",
				"required_space_adjusted": "7717017869",
				"storeAddOns": null,
				"firstIapItems": null
			},
			"recommended_graphics": null,
			"recommended_memory_gb": null,
			"recommended_processor": null,
			"release_date": 1574445659,
			"supported_tracking_modes": [],
			"website_url": "https://espire1.com/",
			"current_offer": {
				"__typename": "AppStoreOffer",
				"offer_type": "APPSTORE_OFFER",
				"id": "494203047850877",
				"__isPurchasableOfferWithApp": "AppStoreOffer",
				"price": {
					"currency": "USD",
					"offset_amount": "2999",
					"formatted": "$29.99"
				},
				"strikethrough_price": null,
				"promo_benefit": null,
				"end_time": 0,
				"show_timer": false,
				"buy_button_captions": []
			},
			"viewer_release_channel": {
				"id": "184742542440946"
			},
			"live_release_channel": {
				"id": "184742542440946",
				"channel_name": "LIVE",
				"latest_supported_binary": {
					"__typename": "AndroidBinary",
					"id": "3823537634370276"
				}
			},
			"release_channels": {
				"count": 1,
				"nodes": [
					{
						"channel_name": "LIVE",
						"id": "184742542440946",
						"latest_supported_binary": {
							"__typename": "AndroidBinary",
							"version": "1.7.218",
							"id": "3823537634370276"
						}
					}
				]
			},
			"grouping": {
				"upcoming_events": {
					"edges": []
				},
				"id": "1237232163126242",
				"posts": {
					"nodes": [
						{
							"id": "307113436953257",
							"title": "New Espire Level \"Militaris\" - included in our free 1.6 Assimilation Update!",
							"created_time": 1590458666,
							"body_text": "Militaris is one of 4 all new \"Intel\" levels included in our free 1.6 Assimilation update. In Militaris, you must infiltrate a Copperhead outpost, hacking data from 4 workstations hidden throughout the environment. Militaris is our biggest challenge environment yet, with plenty of ways to approach each objective. Whether you want to play completely stealthy, or storm the outpost all guns blazing, we hope you enjoy Militaris and the rest of the Assimilation update!",
							"tile_landscape_image": {
								"uri": "https://scontent.oculuscdn.com/v/t64.5771-25/38982708_2572212006367953_53490312978366464_n.png?_nc_cat=107&ccb=3&_nc_sid=79b88e&_nc_ohc=ffAoiIqrdH4AX810iZd&_nc_ht=scontent.oculuscdn.com&oh=7761f5e1005e68f5c6b730662a4a1684&oe=604B3B74"
							}
						},
						{
							"id": "188738228891816",
							"title": "Espire Version 1.5 Hotfix now live",
							"created_time": 1581573467,
							"body_text": "Attention Espire Agents! We hope you’re enjoying our recently released version 1.5 content update. We’ve pushed a quick hotfix for the current v1.5 version of Espire that fixes some issues reported by users since release of the update:\n\n- Fixed an issue with Leaderboards where the “My Rank” button was not correctly showing the user’s rank in some circumstances.\n\n- Adjusted the PAR time, cost and expenditure targets for some virtual challenges based on user feedback.  Some targets were too difficult or easy. \nThey’ve now been adjusted as follows:\n- Hold-Up #2 Togah Expenditure PAR: Decreased from 10000 to 2745\n- Hold-Up #3 Silver Expenditure PAR: Decreased from 7500 to 3000\n- Hold-Up #3 Silver Combined Score PAR: Increased from 4000 to 8000\n- Hold-Up #5 Stellata Combined Score PAR: Increased from 2500 to 9600\n- Hostage #2 Mira Expenditure PAR: Increased from 2500 to 25000\n- Note that to see these new scores reflected in the UI, you’ll have to play the challenge once.\n\n- Fixed an issue where the option to disable the \"HUD Helmet lines\" was not being saved in the user’s save file, so they would have to disable this feature on every play session.\n- Fixed a level streaming issue in Mission 1.3 Research Sector. The \"Lecture Hall\" area would not load if the player visited it after going through a nearby vent system loading trigger.\n- Fixed a level streaming issue in Mission 1.6 Basement level 1. The \"Storage area\" would not load correctly if the player visited it after going through a nearby vent system.\n\nWe have also added a feature:\n- Players can now ‘cancel’ a forced Espire Instinct Slo-Mo event by pressing the Instinct button.\n\nWe’ve been working hard on our next major update for Espire and look forward to sharing news about it with you ahead of its release. If you’re enjoying Espire, we’d appreciate you leaving a review to share your thoughts.\n\nWe’re also on Discord - join us at discord.gg/Espire1. Thanks for supporting the game!",
							"tile_landscape_image": {
								"uri": "https://scontent.oculuscdn.com/v/t64.5771-25/75222942_181253233107296_8514138645542731776_n.png?_nc_cat=102&ccb=3&_nc_sid=79b88e&_nc_ohc=eya7QC-JY1MAX9zcEW9&_nc_ht=scontent.oculuscdn.com&oh=0129c6ae1bffd9e2761c59e808cf8ed1&oe=60488856"
							}
						}
					]
				},
				"iap_items_2": {
					"edges": []
				}
			},
			"externalReviewsForDisplay": {
				"nodes": []
			},
			"externalReviewsComplete": {
				"count": 0
			},
			"user_data_disclosure_translated": null,
			"__isItemWithComfortRating": "Application",
			"comfort_rating": "COMFORTABLE_FOR_SOME",
			"is_viewer_subscribed_coming_soon": false,
			"internet_connection": "NOT_REQUIRED",
			"internet_connection_name": "无需联网",
			"__isItemWithHmdPlatformInformaton": "Application",
			"supported_input_devices_list": [
				{
					"name": "Oculus Touch",
					"tag": "OCULUS_TOUCH"
				}
			],
			"canonicalName": "espire-vr-espire-1-vr-operative-quest-edition",
			"viewer_has_preorder": false,
			"purchase_alerts": [],
			"is_granted_on_hardware_registration": false,
			"current_trial_offer": null,
			"extra_buy_box_section": {
				"content": "Oculus 退款政策",
				"link_uri": "https://www.oculus.com/legal/quest-rift-content-refund-policy/"
			},
			"is_viewer_entitled": false,
			"baseline_offer": {
				"price": {
					"offset_amount": "2999"
				},
				"id": "494203047850877"
			},
			"__isWishlistableItem": "Application",
			"entry": null,
			"is_demo_of": null,
			"appName": "Espire 1: VR Operative",
			"platformOffer": null,
			"is_giftable": true,
			"current_gift_offer": {
				"__typename": "AppStoreOffer",
				"id": "494203047850877"
			},
			"externalReviews": {
				"count": 0
			},
			"quality_rating_aggregate": 4.2043399638336,
			"support_website_url": null,
			"quality_ratings_by_viewer": [],
			"reviewInfo": {
				"count": 1254,
				"orderings": [
					{
						"key": "top",
						"label": "最相关"
					},
					{
						"key": "most_recent",
						"label": "从新到旧"
					}
				]
			},
			"firstQualityRatings": {
				"count": 1254,
				"page_info": {
					"end_cursor": "AQHRwOBVN8QzT_AjaWPuwOGdYzjrfWYAl8uFY3m1CESb6cC7-ocE47yd1tdNfzcZqzy5NePbe-Ym833sadYeLXy1QQ",
					"start_cursor": "AQHRwOBVN8QzT_AjaWPuwOGdYzjrfWYAl8uFY3m1CESb6cC7-ocE47yd1tdNfzcZqzy5NePbe-Ym833sadYeLXy1QQ"
				},
				"edges": [
					{
						"node": {
							"id": "118606633428143",
							"author": {
								"id": "108636527758487",
								"display_name": "Deaklen",
								"profile_photo": {
									"uri": "https://scontent.oculuscdn.com/v/t64.5771-25/q92/c0.77.1126.1126a/s160x160/57569430_117222943566512_2398095605916685520_n.jpg?_nc_cat=110&ccb=3&_nc_sid=79b88e&_nc_ohc=ptevAjVzENgAX-Bipty&_nc_ht=scontent.oculuscdn.com&tp=28&oh=dec4daf8630ebd5492a53400caa11b4f&oe=6049B405"
								}
							},
							"score": 4,
							"reviewDescription": "I'm a massive stealth game fan, having played through every Metal Gear and Splinter Cell multiple times, so when I saw this on the Quest Store, I was intrigued. I also loved Killing Floor 2 and I knew the devs were cool, so I went in with high expectations only to have them shattered.\n\nFirst off, this game felt like a love letter to both franchises I mentioned before as it has you you climb around levels, tossing sticky cameras around corners like Splinter Cell and sticking up guards with a tranq M9 like you're in the jungles of Tselinoyarsk. Certain achievement names also nod at this games obvious homages.\n\nThis game surprised me with its attention to even little details that many other games miss, like the collision weapons have with the environment, or the smoothness of throwing yourself around the map as you climb. I was especially blown away with the quality and responsiveness of the enemies' ragdoll physics as you manipulate them to fit into a hiding spot. I'd argue I haven't seen ragdolls that good even in a AAA game before. \n\nThe level design and enemy placement is fantastic and the AI was much more intelligent at times than I would have expected, often chasing after me or investigating a noise just a little more than some other games would have had them, and that was even on the easier of the 2 difficulties (though I'm not sure if there's a difference in AI between difficulties). \n\nThat all being said, there are a couple reasons I give this game a 4 instead of a 5. I did run into some bugs, namely 2 in a row that blocked my progression. Near the end of the game, at the part where you activate a computer and must defend it with trip mines, that entire arena area did not load for me, it was like an empty space. I had to exit the game and restart from that checkpoint for it to actually load and let me proceed. After that and retrieving the key from the directors office, the gate to the elevator did not open for me. I didn't feel like restarting that checkpoint again though so I remedied it by tying my controller to the end of a broom stick and just clipping my character's hand through the gate to access the control panel to proceed, and at least that worked. \n\nI also would have liked a better boss fight. On my first playthrough, I was able to climb up to the final boss's position and magdump an MP7 into his head in slow-mo before he even finished his voice lines. \n\nThis game has plenty of content to justify the price, however the story feels like it's only the first act of 3, and not in a cute cliffhanger trilogy setup way. It just kind of ends with no clear climax. I hope there's a sequel or episodic story add-ons or something in the near future.\n\nAnyway yeah tl:dr buy the game if you like stealth games, it good.",
							"reviewTitle": "Like OG Splinter Cell in the best ways",
							"review_helpful_count": 42,
							"review_rank_by_viewer": null,
							"date": 1608924614,
							"developerResponse": {
								"date": 1610406580,
								"body": "Hi there! Wow thanks ever so much for the passionate and in depth review! :) We're absolutely delighted you love the game as much as you do along with all the aspects to it. It's very appropriate you compared ourselves with the likes of splinter cell and metal gear as they were definitely our main sources of inspiration when creating Espire. :) We wanted to take aspects out of what made those games cool and add our own unique twist, style and story into a VR environment and we're very proud to have made it happen. :) As a side note It's great to hear you also enjoyed killing floor, it's certainly an awesome game which was developed by our amazing publishers tripwire. In regards to some of the smaller issues you had we're sorry you experienced them. When you say the part where you defend the computer we're assuming you mean the hacking sequence on mission 1.4 data centre. If so it's definitely a new issue we haven't heard about as of yet. We can't imagine that would happen more than once based on the fact we haven't had an issue surrounding that area reported before so you might be ok from now on however if you do happen to find this issue persists, feel free to get in contact with us on our Facebook or discord server and we'll be happy to look into this further and treat it as a matter of concern to fix. In regards to the key from the directors office this key is in the form of the shotgun you pick up and you need to have the shotgun equipped near the elevator in order for the elevator to activate. We would assume this was something you may not have done the first time however if you did have the gun equipped and the elevator didn't work feel free to get back to us and we'll take a look into it. In regards to the remedy though that was an ingenious work around lol! Good job! :) in regards to mission 1.6 (the final mission) we're sorry you didn't think much of the boss fight, just as a side tip you also don't have to kill the boss to gain the keycard to access the final door. You can opt to instead climb up behind him or utilise espire instinct (slow mo) to grab the keycard from him and then you can just go through the door. :) This serves as a good workaround if you don't happen to have much ammo or if you're attempting to speed run the level it will save a good few seconds at the very least. :) We can also confirm we do plan on hopefully developing a sequel at some stage. We appreciate it was a bit of a cliffhanger at the end but it was done intentionally. :) There's no confirmation or timescales as of yet but to make the sequel would definitely be a dream come true so stay tuned for any updates or news surrounding this. :)",
								"id": "126476959307777"
							}
						}
					}
				]
			},
			"can_viewer_review": false,
			"is_offer_region_restricted": false,
			"__isWithWebsitePageMeta": "Application",
			"website_page_meta": {
				"description": "Espire 1: VR Operative is an ambitious new virtual reality game and IP with its sights firmly set on the single-player ‘stealth’ genre. We pitch this as \"Goldeneye 007\"meets \"Metal Gear Solid\" in an immersive VR world.",
				"image_height": 405,
				"image_type": "image/jpeg",
				"image_url": "https://scontent.oculuscdn.com/v/t64.5771-25/q92/s720x720/39031380_828054381275116_2127414007000561885_n.jpg?_nc_cat=102&ccb=3&_nc_sid=79b88e&_nc_ohc=kp3MrJCUnCwAX-E3zvD&_nc_ht=scontent.oculuscdn.com&tp=28&oh=a21b80b2da461c0090c565baf1cb5a26&oe=60492A8F",
				"image_width": 720,
				"og_locale": "zh_CN",
				"og_type": "website",
				"page_url": "https://www.oculus.com/experiences/quest/2228678273856228/",
				"site_name": "Oculus",
				"title": "Espire 1: VR Operative · Oculus Quest"
			},
			"fallback_ranking_trace": ""
		}
	}
}