{
	"data": {
		"viewer": {
			"user": null
		},
		"node": {
			"__typename": "Application",
			"__isAppStoreItem": "Application",
			"id": "2352932654734987",
			"display_name": "OrbusVR: Reborn",
			"platform": "ANDROID_6DOF",
			"category": "GAMES",
			"item_bundles": [],
			"__isWithHeroMediaCarousel": "Application",
			"trailer": {
				"thumbnail": {
					"uri": "https://scontent.oculuscdn.com/v/t64.5771-25/q92/s1440x1440/38974723_343512210345032_7507911220488800224_n.jpg?_nc_cat=110&ccb=1-3&_nc_sid=79b88e&_nc_ohc=9PX2W7GZCKQAX-6HuFx&_nc_ht=scontent.oculuscdn.com&tp=28&oh=e23710ac9be7a2ad382c19ff2b188e7b&oe=60BA321D"
				},
				"uri": "https://scontent.oculuscdn.com/v/t64.7195-25/57569464_362207574820283_81691491480363987_n.mp4?_nc_cat=101&ccb=1-3&_nc_sid=0ed769&_nc_ohc=u0VQy3dfPmMAX-Q2fhH&_nc_ht=scontent.oculuscdn.com&oh=99a8f1487c03867221088100864d173b&oe=60BA06A9"
			},
			"quality_rating_histogram_aggregate_all": [
				{
					"star_rating": 1,
					"count": 178,
					"starRating": 1
				},
				{
					"star_rating": 2,
					"count": 78,
					"starRating": 2
				},
				{
					"star_rating": 3,
					"count": 115,
					"starRating": 3
				},
				{
					"star_rating": 4,
					"count": 316,
					"starRating": 4
				},
				{
					"star_rating": 5,
					"count": 894,
					"starRating": 5
				}
			],
			"display_long_description": "OrbusVR: Reborn is the first MMORPG designed exclusively for room-scale virtual reality. \n\nIt features everything you love about an MMO: a huge open world, hundreds of hours of content, story quests, dragon pets, five-player group dungeons, ten-player Raids, voice chat, player trading, and more! With a community that's been around since the very beginning of VR, and dozens of updates delivered by the developers, OrbusVR is one of the most content-rich games available in virtual reality today.\n\nOrbusVR: Reborn features gorgeous hand-painted visuals, improved performance and stability, and a host of new features, including: \n\n• 4 NEW playable classes (8 total)\n• Opt-in World PvP & Battlegrounds \n• Honor Ranks and Title System \n• NEW enemies, featuring improved monster AI \n• NEW activities, including airship adventures, pet dragon racing, public events and more \n• 100+ hours of content, including weekly missions \n\nImmerse yourself in a world of discovery. Join the OrbusVR community today.",
			"developer_privacy_policy_url": "https://orbusvr.com/account/terms",
			"developer_terms_of_service_url": "https://orbusvr.com/account/terms",
			"supported_player_modes": [
				"ROOM_SCALE",
				"STANDING"
			],
			"publisher_name": "Orbus Online LLC",
			"supported_in_app_languages": [
				{
					"name": "英语"
				}
			],
			"supported_hmd_platforms": [
				"MONTEREY",
				"HOLLYWOOD"
			],
			"supported_input_device_names": [
				"Oculus Touch"
			],
			"user_interaction_mode_names": [
				"多人",
				"单人"
			],
			"age_rating": null,
			"category_name": "游戏",
			"developer_name": "Orbus Online, LLC",
			"genre_names": [
				"冒险",
				"角色扮演",
				"社交"
			],
			"is_360_sensor_setup_required": false,
			"is_concept": false,
			"latest_supported_binary": {
				"__typename": "AndroidBinary",
				"version": "13.06",
				"change_log": "",
				"supported_hmd_types": [
					"MONTEREY",
					"HOLLYWOOD"
				],
				"total_installed_space": "1686723866",
				"id": "4501158029912428",
				"required_space_adjusted": "2631488123",
				"storeAddOns": null,
				"firstIapItems": null
			},
			"recommended_graphics": null,
			"recommended_memory_gb": null,
			"recommended_processor": null,
			"release_date": 1558458000,
			"supported_tracking_modes": [],
			"website_url": "http://orbusvr.com/",
			"current_offer": {
				"__typename": "AppStoreOffer",
				"offer_type": "APPSTORE_OFFER",
				"id": "174055154635734",
				"__isPurchasableOfferWithApp": "AppStoreOffer",
				"price": {
					"currency": "USD",
					"offset_amount": "1499",
					"formatted": "$14.99"
				},
				"strikethrough_price": {
					"currency": "USD",
					"offset_amount": "1999",
					"formatted": "$19.99",
					"offset": 100
				},
				"promo_benefit": "-25%",
				"end_time": 1622530740,
				"show_timer": false,
				"buy_button_captions": []
			},
			"viewer_release_channel": {
				"id": "252132892120009"
			},
			"live_release_channel": {
				"id": "252132892120009",
				"channel_name": "LIVE",
				"latest_supported_binary": {
					"__typename": "AndroidBinary",
					"id": "4501158029912428"
				}
			},
			"release_channels": {
				"count": 1,
				"nodes": [
					{
						"channel_name": "LIVE",
						"id": "252132892120009",
						"latest_supported_binary": {
							"__typename": "AndroidBinary",
							"version": "13.06",
							"id": "4501158029912428"
						}
					}
				]
			},
			"grouping": {
				"upcoming_events": {
					"edges": []
				},
				"id": "484595031929486",
				"posts": {
					"nodes": [
						{
							"id": "497117161413430",
							"title": "Hard Mode Citadel Raid Now Live!",
							"created_time": 1620764135,
							"body_text": "The Hard Mode Citadel Raid is now officially live. During the two-week beta period we made some changes to mechanics, as well as scaling, based upon community feedback. We are excited for players to go through the full raid, as it will be the most challenging content we have in game so far.\n\nThe bosses will drop +6 gear and weapons, with a chance at a +7 legendary. You can also earn an Enraged Sephotep pet, mount, and cape, as well as achievements and a title.\n\n\n\nAs with the normal mode raid you will receive a token for that specific gear every time you kill the boss if you do not receive an armor/weapon drop. These will be Citadel Hard Mode tokens that you can redeem at the Hard Mode Vendor inside of Highsteppe.\n\nThis patch also includes the second round of balancing for the tank/healer/support classes, with the changes we have made based upon player feedback.",
							"tile_landscape_image": {
								"uri": "https://scontent.oculuscdn.com/v/t64.5771-25/57572930_918892765511029_3450956147978729990_n.png?_nc_cat=100&ccb=1-3&_nc_sid=79b88e&_nc_ohc=sATApBjRYLgAX-8OAO2&_nc_ht=scontent.oculuscdn.com&oh=de76dd6e6f55b36fb0f039ee6990036c&oe=60B8C548"
							}
						},
						{
							"id": "199736345123415",
							"title": "Hard Mode Citadel Raid Beta Test",
							"created_time": 1619626070,
							"body_text": "The Beta test for the Hard Mode version of the Citadel Raid is now available.\n\nTo access the Hard Mode Citadel Raid, enter the normal version of the Citadel Raid, then go through the portal on the right-hand side marked Hard Mode. Leaving the Hard Mode Raid will place you back inside Highsteppe.\n\nThe Beta will last for 2 weeks, which should give the Dev team enough time to work out any bugs, uncover any potential flaws in the fights, and make sure the balance is just the right amount of challenge: not too easy, but not impossible to defeat. To make testing the mechanics easier for the Beta, we have removed all the trash spawns, as well as the boss kill requirements to spawn the next boss in line. During the Beta, no armor, weapons, or rewards will drop.\n\nThe official Hard Mode Citadel Raid will launch on Tuesday, May 11.\n\nThis update also includes a very large fix for the ongoing invisible players/mob issues, which may have widespread repercussions on other issues affecting the game. To report any new issues or offer feedback on the Hard Mode Raid, please visit the OrbusVR Community Forums at community.orbusvr.com.",
							"tile_landscape_image": {
								"uri": "https://scontent.oculuscdn.com/v/t64.5771-25/75367596_163967875634441_1777661525461635970_n.png?_nc_cat=111&ccb=1-3&_nc_sid=79b88e&_nc_ohc=bRVlLM0YgYMAX8avUWW&_nc_ht=scontent.oculuscdn.com&oh=2450ccf376710da69d512032467273b4&oe=60BA3CF8"
							}
						}
					]
				},
				"iap_items_2": {
					"edges": [
						{
							"cursor": "AQHRJHBf1LKdJ8hZh3bw8SvCAcNLcBurI2CjvO7v_hVc3kMMtXa2vs3-_Rnq0OEORnXsNJgwvHo-r_90enGjFQbAog"
						}
					]
				}
			},
			"externalReviewsForDisplay": {
				"nodes": []
			},
			"externalReviewsComplete": {
				"count": 0
			},
			"user_data_disclosure_translated": null,
			"__isItemWithComfortRating": "Application",
			"comfort_rating": "COMFORTABLE_FOR_SOME",
			"is_viewer_subscribed_coming_soon": false,
			"internet_connection": "REQUIRED",
			"internet_connection_name": "需要连接网络",
			"__isItemWithHmdPlatformInformaton": "Application",
			"supported_input_devices_list": [
				{
					"name": "Oculus Touch",
					"tag": "OCULUS_TOUCH"
				}
			],
			"canonicalName": "orbus-online-llc-orbusvr-android6d0f",
			"viewer_has_preorder": false,
			"purchase_alerts": [],
			"is_granted_on_hardware_registration": false,
			"current_trial_offer": null,
			"extra_buy_box_section": {
				"content": "Oculus 退款政策",
				"link_uri": "https://www.oculus.com/legal/quest-rift-content-refund-policy/"
			},
			"is_viewer_entitled": false,
			"baseline_offer": {
				"price": {
					"offset_amount": "1999"
				},
				"id": "527918914775620"
			},
			"__isWishlistableItem": "Application",
			"entry": null,
			"is_demo_of": null,
			"appName": "OrbusVR: Reborn",
			"platformOffer": null,
			"is_giftable": true,
			"current_gift_offer": {
				"__typename": "AppStoreOffer",
				"id": "174055154635734"
			},
			"externalReviews": {
				"count": 0
			},
			"quality_rating_aggregate": 4.056293485136,
			"support_website_url": "https://community.orbusvr.com/",
			"quality_ratings_by_viewer": [],
			"reviewInfo": {
				"count": 758,
				"orderings": [
					{
						"key": "top",
						"label": "最相关"
					},
					{
						"key": "most_recent",
						"label": "从新到旧"
					}
				]
			},
			"firstQualityRatings": {
				"count": 758,
				"page_info": {
					"end_cursor": "AQHRFrNJgYKkkMnpOxnVYqyyp_Uxi86-YQabY9exsoqbxfuG--PsH4_FsobqZVxAHvBzJl2UgtUYfTcDqypNPQJBJg",
					"start_cursor": "AQHRFrNJgYKkkMnpOxnVYqyyp_Uxi86-YQabY9exsoqbxfuG--PsH4_FsobqZVxAHvBzJl2UgtUYfTcDqypNPQJBJg"
				},
				"edges": [
					{
						"node": {
							"id": "122113149959374",
							"author": {
								"id": "108774037959952",
								"display_name": "333GLEAM",
								"profile_photo": {
									"uri": "https://scontent.oculuscdn.com/v/t64.5771-25/q92/c0.0.612.612a/s160x160/75334052_108796604624362_4702180219251809333_n.jpg?_nc_cat=101&ccb=1-3&_nc_sid=79b88e&_nc_ohc=U0HEb8eTlQQAX8uMdct&_nc_ht=scontent.oculuscdn.com&tp=28&oh=4debdfd73dc81e1a767e61600c6fbcfa&oe=60BA0DD6"
								}
							},
							"score": 4,
							"reviewDescription": "Orbus offers a lot for $20 and will definitely keep you occupied every day for at least a few hours at a time before the experience begins to drag. There’s a handful of classes and your character can switch amongst them freely by switching your weapon type, and then leveling up each class individually. This means that you can switch your class as necessary in the middle of dungeons or wherever else which is pretty cool. The option to turn on open world PVP is there, and you can attack anyone in the world who also has it turned on and can loot them of everything if you beat them. The community is generally very helpful and if you have any questions about how anything works you can usually always ask anyone who’s around for some advice. There seems to be a story somewhere here, as when you talk to NPC’s they will refer to specific events and people and it all seems interesting enough and something I’d be in to, but it sort of just throws you in with no sense of where you are amongst all of it. Maybe I’m missing something, it definitely seems like I am, but at the moment I am having a tough time piecing together what’s actually happening. The combat is fun with most classes, and each class has it’s own unique way of utilizing your weapons. I started off as a shaman, which has you equip different totems that have different effects which you lay on the ground, if I remember right you can lay down a max of 3, and you cast spells that spawn from the totems which you physically pick up and cast. I now am a runemage at level 13, and have to say it’s the most fun I’ve had with any of the other classes. The runemage has you draw out spells in mid air in order to cast them, and doesn’t have any sort of level limit on the spells you can cast, meaning every spell is available to you from level 1. You can grab a starter weapon from each class from a weapons vendor in the middle of the town at the beginning. I think the amount of content in the game right now is more than enough to make the game worth playing and it’s definitely fun running dungeons and public events killing monsters with other people, but it also feels a little bland. And I mean that in the best way possible, the game has a lot charm, it reminds me so much of playing RuneScape in the early 2000’s, but I think at the moment it seems like an early version of something really amazing. You can really feel the love the creators have for the game in the design of everything. I think what I love most about the game is how it actually takes skill and effort to be successful, especially in combat, it doesn’t necessarily come down to how big your “numbers” are. It’s my most played game on the oculus right now, and probably will continue to be until someone does an MMO in VR better than Orbus.\n\nUpdate: I just noticed they’re now starting to share the lore on their website, and they also point out that there are in-game books that also explain everything, so that’s nice to see after posting about not knowing about story. It’s really involved, it’s definitely had a lot of thought put in to and is kind of overwhelming at first lol, but I gotta say it’s all really cool. Also, don’t let the reviews saying that the game is too confusing or that it lacks guidance sway your decision to buy it too much, it really isn’t that difficult to pick up on how to play and what to do, it just takes a little effort and dedication. I know opinions and ratings are subjective, but this game without question deserves better than just one star. I also see a lot of people calling it overly buggy, which it just isn’t. I’m running it on my Quest 2, I’ve rarely run in to any issues and can’t really think of anything major off the top of my head. I’ve seen people call the runemage a buggy class with how the spells can be difficult to cast, and they definitely can be, but it’s really nothing you can’t learn to do well through practice. You have to draw your spells as if they’re on a 2D plane to the best of your ability, like it’s on a piece of paper in front of you. It really just takes practice, it’s a pretty great feeling once your muscle memory takes over and you’re casting spells rapidly. The lag that happens at times can be frustrating, but I’ve not experienced any more lag than I would in any other online game. I promise if you like MMO’s and have a basic grasp of them, you’ll most likely enjoy your time with this. If you really are struggling with what to do, just grab missions from any NPC you can and complete them to gold. Doing critter capture missions are also a great way to level up.",
							"reviewTitle": "Very fun with a lot of potential",
							"review_helpful_count": 118,
							"review_rank_by_viewer": null,
							"date": 1619371954,
							"developerResponse": null
						}
					}
				]
			},
			"can_viewer_review": false,
			"is_offer_region_restricted": false,
			"__isWithWebsitePageMeta": "Application",
			"website_page_meta": {
				"description": "OrbusVR: Reborn is the first MMORPG designed exclusively for room-scale virtual reality. It features everything you love about an MMO: a huge open world, hundreds of hours of quests, dragon pets, five-player group dungeons, ten-player Raids, voice chat, player trading, and more!",
				"image_height": 405,
				"image_type": "image/jpeg",
				"image_url": "https://scontent.oculuscdn.com/v/t64.5771-25/q92/s720x720/38982530_4376734062352846_5655508979984367616_n.jpg?_nc_cat=1&ccb=1-3&_nc_sid=79b88e&_nc_ohc=6w-_yqGWlkAAX8X0M2n&_nc_ht=scontent.oculuscdn.com&tp=28&oh=68403329fc9bd3e8b3add6829c2ec9d4&oe=60B91264",
				"image_width": 720,
				"og_locale": "zh_CN",
				"og_type": "website",
				"page_url": "https://www.oculus.com/experiences/quest/2352932654734987/",
				"site_name": "Oculus",
				"title": "OrbusVR: Reborn · Oculus Quest"
			},
			"fallback_ranking_trace": ""
		}
	}
}